import React from "react";
import { Helmet } from "react-helmet-async";
import Down from "../Components/downIcon";
import Header from "../Components/Header";
import Menu from "../Components/menu";
import Footer from "../Components/Footer";
import MenuTwo from "../Components/menuTwo";

const ThirtyEight = () => {
  return (
    <div>
      <Helmet>
        <title>038 - سورة ص</title>
      </Helmet>
      <Header />
      <Menu />
      <MenuTwo />
      <div className="sura">
        <p className="suraTitle">سورة ص</p>
        <p className="suraStart">بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ</p>
        <p className="suraWords">
          صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ
          <span className="numberTheme"> (1) </span> بَلِ ٱلَّذِينَ كَفَرُواْ
          فِي عِزَّةٖ وَشِقَاقٖ
          <span className="numberTheme"> (2) </span> كَمۡ أَهۡلَكۡنَا مِن
          قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ
          <span className="numberTheme"> (3) </span> وَعَجِبُوٓاْ أَن جَآءَهُم
          مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ
          <span className="numberTheme"> (4) </span>
          أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ
          <span className="numberTheme"> (5) </span> وَٱنطَلَقَ ٱلۡمَلَأُ
          مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ
          هَٰذَا لَشَيۡءٞ يُرَادُ
          <span className="numberTheme"> (6) </span> مَا سَمِعۡنَا بِهَٰذَا فِي
          ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ
          <span className="numberTheme"> (7) </span>
          أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن
          ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ
          <span className="numberTheme"> (8) </span> أَمۡ عِندَهُمۡ خَزَآئِنُ
          رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ
          <span className="numberTheme"> (9) </span> أَمۡ لَهُم مُّلۡكُ
          ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي
          ٱلۡأَسۡبَٰبِ
          <span className="numberTheme"> (10) </span> جُندٞ مَّا هُنَالِكَ
          مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ
          <span className="numberTheme"> (11) </span> كَذَّبَتۡ قَبۡلَهُمۡ
          قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ
          <span className="numberTheme"> (12) </span> وَثَمُودُ وَقَوۡمُ لُوطٖ
          وَأَصۡحَٰبُ لۡـَٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ
          <span className="numberTheme"> (13) </span> إِن كُلٌّ إِلَّا كَذَّبَ
          ٱلرُّسُلَ فَحَقَّ عِقَابِ
          <span className="numberTheme"> (14) </span> وَمَا يَنظُرُ هَٰٓؤُلَآءِ
          إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ
          <span className="numberTheme"> (15) </span> وَقَالُواْ رَبَّنَا عَجِّل
          لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ
          <span className="numberTheme"> (16) </span> ٱصۡبِرۡ عَلَىٰ مَا
          يَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَيۡدِۖ إِنَّهُۥٓ
          أَوَّابٌ
          <span className="numberTheme"> (17) </span> إِنَّا سَخَّرۡنَا
          ٱلۡجِبَالَ مَعَهُۥ يُسَبِّحۡنَ بِٱلۡعَشِيِّ وَٱلۡإِشۡرَاقِ
          <span className="numberTheme"> (18) </span> وَٱلطَّيۡرَ مَحۡشُورَةٗۖ
          كُلّٞ لَّهُۥٓ أَوَّابٞ
          <span className="numberTheme"> (19) </span> وَشَدَدۡنَا مُلۡكَهُۥ
          وَءَاتَيۡنَٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ
          <span className="numberTheme"> (20) </span>
          <span className="partTheme"> ۞ </span>وَهَلۡ أَتَىٰكَ نَبَؤُاْ
          ٱلۡخَصۡمِ إِذۡ تَسَوَّرُواْ ٱلۡمِحۡرَابَ
          <span className="numberTheme"> (21) </span> إِذۡ دَخَلُواْ عَلَىٰ
          دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُواْ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ
          بَعۡضُنَا عَلَىٰ بَعۡضٖ فَٱحۡكُم بَيۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ
          وَٱهۡدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ
          <span className="numberTheme"> (22) </span> إِنَّ هَٰذَآ أَخِي لَهُۥ
          تِسۡعٞ وَتِسۡعُونَ نَعۡجَةٗ وَلِيَ نَعۡجَةٞ وَٰحِدَةٞ فَقَالَ
          أَكۡفِلۡنِيهَا وَعَزَّنِي فِي ٱلۡخِطَابِ
          <span className="numberTheme"> (23) </span> قَالَ لَقَدۡ ظَلَمَكَ
          بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ
          ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ
          ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ
          دَاوُۥدُ أَنَّمَا فَتَنَّٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ
          وَأَنَابَ۩
          <span className="numberTheme"> (24) </span> فَغَفَرۡنَا لَهُۥ ذَٰلِكَۖ
          وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ
          <span className="numberTheme"> (25) </span> يَٰدَاوُۥدُ إِنَّا
          جَعَلۡنَٰكَ خَلِيفَةٗ فِي ٱلۡأَرۡضِ فَٱحۡكُم بَيۡنَ ٱلنَّاسِ
          بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِۚ
          إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدُۢ
          بِمَا نَسُواْ يَوۡمَ ٱلۡحِسَابِ
          <span className="numberTheme"> (26) </span> وَمَا خَلَقۡنَا
          ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ
          ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ
          <span className="numberTheme"> (27) </span>
          أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ
          كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ
          كَٱلۡفُجَّارِ
          <span className="numberTheme"> (28) </span> كِتَٰبٌ أَنزَلۡنَٰهُ
          إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ
          أُوْلُواْ ٱلۡأَلۡبَٰبِ
          <span className="numberTheme"> (29) </span> وَوَهَبۡنَا لِدَاوُۥدَ
          سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ
          <span className="numberTheme"> (30) </span> إِذۡ عُرِضَ عَلَيۡهِ
          بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ
          <span className="numberTheme"> (31) </span> فَقَالَ إِنِّيٓ أَحۡبَبۡتُ
          حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ
          <span className="numberTheme"> (32) </span> رُدُّوهَا عَلَيَّۖ
          فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ
          <span className="numberTheme"> (33) </span> وَلَقَدۡ فَتَنَّا
          سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ
          <span className="numberTheme"> (34) </span> قَالَ رَبِّ ٱغۡفِرۡ لِي
          وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ
          أَنتَ ٱلۡوَهَّابُ
          <span className="numberTheme"> (35) </span> فَسَخَّرۡنَا لَهُ ٱلرِّيحَ
          تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ
          <span className="numberTheme"> (36) </span> وَٱلشَّيَٰطِينَ كُلَّ
          بَنَّآءٖ وَغَوَّاصٖ
          <span className="numberTheme"> (37) </span> وَءَاخَرِينَ مُقَرَّنِينَ
          فِي ٱلۡأَصۡفَادِ
          <span className="numberTheme"> (38) </span> هَٰذَا عَطَآؤُنَا
          فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ
          <span className="numberTheme"> (39) </span>
          وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ
          <span className="numberTheme"> (40) </span> وَٱذۡكُرۡ عَبۡدَنَآ
          أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ
          وَعَذَابٍ
          <span className="numberTheme"> (41) </span> ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا
          مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ
          <span className="numberTheme"> (42) </span> وَوَهَبۡنَا لَهُۥٓ
          أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةٗ مِّنَّا وَذِكۡرَىٰ لِأُوْلِي
          ٱلۡأَلۡبَٰبِ
          <span className="numberTheme"> (43) </span> وَخُذۡ بِيَدِكَ ضِغۡثٗا
          فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ
          ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ
          <span className="numberTheme"> (44) </span> وَٱذۡكُرۡ عِبَٰدَنَآ
          إِبۡرَٰهِيمَ وَإِسۡحَٰقَ وَيَعۡقُوبَ أُوْلِي ٱلۡأَيۡدِي وَٱلۡأَبۡصَٰرِ
          <span className="numberTheme"> (45) </span> إِنَّآ أَخۡلَصۡنَٰهُم
          بِخَالِصَةٖ ذِكۡرَى ٱلدَّارِ
          <span className="numberTheme"> (46) </span> وَإِنَّهُمۡ عِندَنَا
          لَمِنَ ٱلۡمُصۡطَفَيۡنَ ٱلۡأَخۡيَارِ
          <span className="numberTheme"> (47) </span> وَٱذۡكُرۡ إِسۡمَٰعِيلَ
          وَٱلۡيَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلّٞ مِّنَ ٱلۡأَخۡيَارِ
          <span className="numberTheme"> (48) </span> هَٰذَا ذِكۡرٞۚ وَإِنَّ
          لِلۡمُتَّقِينَ لَحُسۡنَ مَـَٔابٖ
          <span className="numberTheme"> (49) </span> جَنَّٰتِ عَدۡنٖ
          مُّفَتَّحَةٗ لَّهُمُ ٱلۡأَبۡوَٰبُ
          <span className="numberTheme"> (50) </span> مُتَّكِـِٔينَ فِيهَا
          يَدۡعُونَ فِيهَا بِفَٰكِهَةٖ كَثِيرَةٖ وَشَرَابٖ
          <span className="numberTheme"> (51) </span>
          <span className="partTheme"> ۞ </span>وَعِندَهُمۡ قَٰصِرَٰتُ ٱلطَّرۡفِ
          أَتۡرَابٌ
          <span className="numberTheme"> (52) </span> هَٰذَا مَا تُوعَدُونَ
          لِيَوۡمِ ٱلۡحِسَابِ
          <span className="numberTheme"> (53) </span> إِنَّ هَٰذَا لَرِزۡقُنَا
          مَا لَهُۥ مِن نَّفَادٍ
          <span className="numberTheme"> (54) </span> هَٰذَاۚ وَإِنَّ
          لِلطَّٰغِينَ لَشَرَّ مَـَٔابٖ
          <span className="numberTheme"> (55) </span> جَهَنَّمَ يَصۡلَوۡنَهَا
          فَبِئۡسَ ٱلۡمِهَادُ
          <span className="numberTheme"> (56) </span> هَٰذَا فَلۡيَذُوقُوهُ
          حَمِيمٞ وَغَسَّاقٞ
          <span className="numberTheme"> (57) </span>
          وَءَاخَرُ مِن شَكۡلِهِۦٓ أَزۡوَٰجٌ
          <span className="numberTheme"> (58) </span> هَٰذَا فَوۡجٞ مُّقۡتَحِمٞ
          مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُواْ ٱلنَّارِ
          <span className="numberTheme"> (59) </span>
          قَالُواْ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ
          لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ
          <span className="numberTheme"> (60) </span> قَالُواْ رَبَّنَا مَن
          قَدَّمَ لَنَا هَٰذَا فَزِدۡهُ عَذَابٗا ضِعۡفٗا فِي ٱلنَّارِ
          <span className="numberTheme"> (61) </span> وَقَالُواْ مَا لَنَا لَا
          نَرَىٰ رِجَالٗا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ
          <span className="numberTheme"> (62) </span>
          أَتَّخَذۡنَٰهُمۡ سِخۡرِيًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَٰرُ
          <span className="numberTheme"> (63) </span>
          إِنَّ ذَٰلِكَ لَحَقّٞ تَخَاصُمُ أَهۡلِ ٱلنَّارِ
          <span className="numberTheme"> (64) </span> قُلۡ إِنَّمَآ أَنَا۠
          مُنذِرٞۖ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ
          <span className="numberTheme"> (65) </span> رَبُّ ٱلسَّمَٰوَٰتِ
          وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا ٱلۡعَزِيزُ ٱلۡغَفَّٰرُ
          <span className="numberTheme"> (66) </span> قُلۡ هُوَ نَبَؤٌاْ عَظِيمٌ
          <span className="numberTheme"> (67) </span> أَنتُمۡ عَنۡهُ مُعۡرِضُونَ
          <span className="numberTheme"> (68) </span> مَا كَانَ لِيَ مِنۡ
          عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰٓ إِذۡ يَخۡتَصِمُونَ
          <span className="numberTheme"> (69) </span> إِن يُوحَىٰٓ إِلَيَّ
          إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ
          <span className="numberTheme"> (70) </span> إِذۡ قَالَ رَبُّكَ
          لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن طِينٖ
          <span className="numberTheme"> (71) </span> فَإِذَا سَوَّيۡتُهُۥ
          وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ
          <span className="numberTheme"> (72) </span> فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ
          كُلُّهُمۡ أَجۡمَعُونَ
          <span className="numberTheme"> (73) </span> إِلَّآ إِبۡلِيسَ
          ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ
          <span className="numberTheme"> (74) </span> قَالَ يَٰٓإِبۡلِيسُ مَا
          مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِيَدَيَّۖ أَسۡتَكۡبَرۡتَ أَمۡ
          كُنتَ مِنَ ٱلۡعَالِينَ
          <span className="numberTheme"> (75) </span> قَالَ أَنَا۠ خَيۡرٞ
          مِّنۡهُ خَلَقۡتَنِي مِن نَّارٖ وَخَلَقۡتَهُۥ مِن طِينٖ
          <span className="numberTheme"> (76) </span> قَالَ فَٱخۡرُجۡ مِنۡهَا
          فَإِنَّكَ رَجِيمٞ
          <span className="numberTheme"> (77) </span> وَإِنَّ عَلَيۡكَ
          لَعۡنَتِيٓ إِلَىٰ يَوۡمِ ٱلدِّينِ
          <span className="numberTheme"> (78) </span> قَالَ رَبِّ فَأَنظِرۡنِيٓ
          إِلَىٰ يَوۡمِ يُبۡعَثُونَ
          <span className="numberTheme"> (79) </span> قَالَ فَإِنَّكَ مِنَ
          ٱلۡمُنظَرِينَ
          <span className="numberTheme"> (80) </span> إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ
          ٱلۡمَعۡلُومِ
          <span className="numberTheme"> (81) </span> قَالَ فَبِعِزَّتِكَ
          لَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ
          <span className="numberTheme"> (82) </span> إِلَّا عِبَادَكَ مِنۡهُمُ
          ٱلۡمُخۡلَصِينَ
          <span className="numberTheme"> (83) </span> قَالَ فَٱلۡحَقُّ
          وَٱلۡحَقَّ أَقُولُ
          <span className="numberTheme"> (84) </span> لَأَمۡلَأَنَّ جَهَنَّمَ
          مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِينَ
          <span className="numberTheme"> (85) </span> قُلۡ مَآ أَسۡـَٔلُكُمۡ
          عَلَيۡهِ مِنۡ أَجۡرٖ وَمَآ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِينَ
          <span className="numberTheme"> (86) </span> إِنۡ هُوَ إِلَّا ذِكۡرٞ
          لِّلۡعَٰلَمِينَ
          <span className="numberTheme"> (87) </span> وَلَتَعۡلَمُنَّ نَبَأَهُۥ
          بَعۡدَ حِينِۭ
          <span className="numberTheme"> (88) </span>
        </p>
        <p className="suraEnd">صَدَقَ اللهُ العَظيمُ</p>
      </div>
      <Footer />
      <Down />
    </div>
  );
};

export default ThirtyEight;
