import React from 'react';
import { Helmet } from 'react-helmet-async';
import {  } from '@fortawesome/react-fontawesome'
import {  } from '@fortawesome/free-solid-svg-icons';
import {  } from "react-router-dom";
import Down from '../Components/downIcon'
import Header from '../Components/Header'
import Menu from '../Components/menu'


const App = () => {
  return (
    <div className='app'>
      <Helmet>
        <title>404</title>
      </Helmet>      
      <Header />
      <Menu />
      <div className='sura'>
        <h1 className='suraTitle'>سورة الفاتحة</h1>
        <h1 className='suraStart'>بسم الله الرحمن الرحيم</h1>
        <p className='suraWords'>
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم
          الحمد لله رب العالمين .. الرحمن الرحيم

        </p>
        <h1 className='suraEnd'>صدق الله العظيم</h1>
      </div>
      <Down />
    </div>
  );
}

export default App;